Revit 2024 API
BuiltInFailures.SketchFailures.ElevationSketchNotAllowed Property
 Wall in a family can't have an elevation profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElevationSketchNotAllowed { get; }
Visual Basic
Public Shared ReadOnly Property ElevationSketchNotAllowed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElevationSketchNotAllowed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace